Can't copy pinned element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyLocked { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyLocked As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyLocked {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace